04_Simulation/3.CLUSTERING/PH_2D_RANS_kOmegaSSTx_baseline/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
32000
(
(0.024021779 1.0004176 0.089285714)
(0.072066783 1.0005547 0.089285714)
(0.1201037 0.99990557 0.089285714)
(0.16806508 0.99736973 0.089285714)
(0.21575978 0.99189266 0.089285714)
(0.26282663 0.98254633 0.089285714)
(0.30874267 0.96866828 0.089285714)
(0.3530037 0.95016793 0.089285714)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(0.0225 3.0357143 0.089285714)
(0.0675 3.0357143 0.089285714)
(0.1125 3.0357143 0.089285714)
(0.1575 3.0357143 0.089285714)
(0.2025 3.0357143 0.089285714)
(0.2475 3.0357143 0.089285714)
(0.2925 3.0357143 0.089285714)
(0.3375 3.0357143 0.089285714)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<vector> 
200
(
(0.024022463 1.0001266 0.089285714)
(0.072067475 1.0002638 0.089285714)
(0.12010235 0.99961464 0.089285714)
(0.16805969 0.99707892 0.089285714)
(0.21574845 0.99160253 0.089285714)
(0.2628078 0.98225803 0.089285714)
(0.30871541 0.96838347 0.089285714)
(0.35296851 0.94988773 0.089285714)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
