04_Simulation/3.CLUSTERING/PH_2D_RANS_kOmegaSSTx_baseline/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
32000
(
1.0004176
1.0005547
0.99990557
0.99736973
0.99189266
0.98254633
0.96866828
0.95016793
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
3.0357143
3.0357143
3.0357143
3.0357143
3.0357143
3.0357143
3.0357143
3.0357143
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
1.0001266
1.0002638
0.99961464
0.99707892
0.99160253
0.98225803
0.96838347
0.94988773
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
