04_Simulation/3.CLUSTERING/PH_2D_RANS_kOmegaSSTx_baseline/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
32000
(
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
0.089285714
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
